#### Terraform Plan for `production` EKS Infrastructure 📖

<details>
<summary>Show Plan</summary>

```terraform
data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=305032652600]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_cloudwatch_log_group.eks will be created
  + resource "aws_cloudwatch_log_group" "eks" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/fiap-tech-challenge-eks-production/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all          = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
    }

  # aws_ecr_lifecycle_policy.app will be created
  + resource "aws_ecr_lifecycle_policy" "app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "sha",
                              + "main",
                              + "develop",
                              + "staging",
                              + "production",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "fiap-tech-challenge-api"
    }

  # aws_ecr_repository.app will be created
  + resource "aws_ecr_repository" "app" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "fiap-tech-challenge-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "ecr"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fiap-tech-challenge-api-ecr-production"
          + "Phase"       = "3"
          + "Project"     = "fiap-tech-challenge"
          + "Team"        = "fiap-pos-grad"
        }
      + tags_all             = {
          + "Component"   = "ecr"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fiap-tech-challenge-api-ecr-production"
          + "Phase"       = "3"
          + "Project"     = "fiap-tech-challenge"
          + "Team"        = "fiap-pos-grad"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-nat-eip-1-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all             = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-nat-eip-1-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + vpc                  = (known after apply)
    }

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "fiap-tech-challenge-eks-production"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all                    = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
    }

  # aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "fiap-tech-challenge-eks-production"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all                    = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
    }

  # aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "fiap-tech-challenge-eks-production"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all                    = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
    }

  # aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "fiap-tech-challenge-eks-production"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "ManagedBy"                                                = "terraform"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "owned"
        }
      + tags_all                      = {
          + "ManagedBy"                                                = "terraform"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "owned"
        }
      + version                       = "1.31"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.main will be created
  + resource "aws_eks_node_group" "main" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "fiap-tech-challenge-eks-production"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + labels                 = {
          + "environment" = "production"
          + "role"        = "worker"
        }
      + node_group_name        = "fiap-tech-challenge-nodes-production"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-nodes-production"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "owned"
        }
      + tags_all               = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-nodes-production"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "owned"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-oidc-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all        = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-oidc-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_policy.aws_lb_controller will be created
  + resource "aws_iam_policy" "aws_lb_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for AWS Load Balancer Controller"
      + id               = (known after apply)
      + name             = "fiap-tech-challenge-aws-lb-controller-production"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-aws-lb-controller-policy-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-aws-lb-controller-policy-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
    }

  # aws_iam_role.aws_lb_controller will be created
  + resource "aws_iam_role" "aws_lb_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-tech-challenge-aws-lb-controller-production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-aws-lb-controller-role-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-aws-lb-controller-role-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-tech-challenge-eks-cluster-production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-cluster-role-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-cluster-role-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_nodes will be created
  + resource "aws_iam_role" "eks_nodes" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-tech-challenge-eks-nodes-production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-nodes-role-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-nodes-role-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.aws_lb_controller will be created
  + resource "aws_iam_role_policy_attachment" "aws_lb_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "fiap-tech-challenge-aws-lb-controller-production"
    }

  # aws_iam_role_policy_attachment.ecr_read_only will be created
  + resource "aws_iam_role_policy_attachment" "ecr_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "fiap-tech-challenge-eks-nodes-production"
    }

  # aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "fiap-tech-challenge-eks-cluster-production"
    }

  # aws_iam_role_policy_attachment.eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "fiap-tech-challenge-eks-nodes-production"
    }

  # aws_iam_role_policy_attachment.eks_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "fiap-tech-challenge-eks-cluster-production"
    }

  # aws_iam_role_policy_attachment.eks_worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "fiap-tech-challenge-eks-nodes-production"
    }

  # aws_iam_role_policy_attachment.secrets_manager_read will be created
  + resource "aws_iam_role_policy_attachment" "secrets_manager_read" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecretsManagerReadWrite"
      + role       = "fiap-tech-challenge-eks-nodes-production"
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-igw-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-igw-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + vpc_id   = (known after apply)
    }

  # aws_kms_alias.eks will be created
  + resource "aws_kms_alias" "eks" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/fiap-tech-challenge-eks-production"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.eks will be created
  + resource "aws_kms_key" "eks" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for EKS cluster fiap-tech-challenge-eks-production"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-kms-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all                           = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-kms-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
    }

  # aws_launch_template.eks_nodes will be created
  + resource "aws_launch_template" "eks_nodes" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "fiap-tech-challenge-nodes-"
      + tags            = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all        = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "ManagedBy"                                                = "terraform"
              + "Name"                                                     = "fiap-tech-challenge-node-production"
              + "Phase"                                                    = "3"
              + "Project"                                                  = "fiap-tech-challenge"
              + "Team"                                                     = "fiap-pos-grad"
              + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "owned"
            }
        }
    }

  # aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-nat-1-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all                           = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-nat-1-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-rt-private-1-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-rt-private-1-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-rt-public-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-rt-public-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.eks_cluster will be created
  + resource "aws_security_group" "eks_cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "fiap-tech-challenge-eks-cluster-sg-production"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-cluster-sg-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-eks-cluster-sg-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.eks_nodes will be created
  + resource "aws_security_group" "eks_nodes" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS worker nodes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "fiap-tech-challenge-eks-nodes-sg-production"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-eks-nodes-sg-production"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "owned"
        }
      + tags_all               = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-eks-nodes-sg-production"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC endpoints"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "HTTPS from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "fiap-tech-challenge-vpc-endpoints-sg-production"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-vpc-endpoints-sg-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Name"      = "fiap-tech-challenge-vpc-endpoints-sg-production"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.cluster_egress_nodes will be created
  + resource "aws_security_group_rule" "cluster_egress_nodes" {
      + description              = "Allow cluster to communicate with nodes"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.cluster_ingress_nodes will be created
  + resource "aws_security_group_rule" "cluster_ingress_nodes" {
      + description              = "Allow nodes to communicate with cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.nodes_cluster_egress will be created
  + resource "aws_security_group_rule" "nodes_cluster_egress" {
      + description              = "Allow nodes to communicate with cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.nodes_cluster_ingress will be created
  + resource "aws_security_group_rule" "nodes_cluster_ingress" {
      + description              = "Allow cluster to communicate with nodes"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # aws_security_group_rule.nodes_dns_tcp will be created
  + resource "aws_security_group_rule" "nodes_dns_tcp" {
      + description              = "Allow DNS TCP"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # aws_security_group_rule.nodes_dns_udp will be created
  + resource "aws_security_group_rule" "nodes_dns_udp" {
      + description              = "Allow DNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # aws_security_group_rule.nodes_egress_all will be created
  + resource "aws_security_group_rule" "nodes_egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes outbound access"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.nodes_internal will be created
  + resource "aws_security_group_rule" "nodes_internal" {
      + description              = "Allow nodes to communicate with each other"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-private-us-east-1a"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "shared"
          + "kubernetes.io/role/internal-elb"                          = "1"
        }
      + tags_all                                       = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-private-us-east-1a"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "shared"
          + "kubernetes.io/role/internal-elb"                          = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-private-us-east-1b"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "shared"
          + "kubernetes.io/role/internal-elb"                          = "1"
        }
      + tags_all                                       = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-private-us-east-1b"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "shared"
          + "kubernetes.io/role/internal-elb"                          = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-public-us-east-1a"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "shared"
          + "kubernetes.io/role/elb"                                   = "1"
        }
      + tags_all                                       = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-public-us-east-1a"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "shared"
          + "kubernetes.io/role/elb"                                   = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-public-us-east-1b"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/fiap-tech-challenge-eks-production" = "shared"
          + "kubernetes.io/role/elb"                                   = "1"
        }
      + tags_all                                       = {
          + "ManagedBy"                                                = "terraform"
          + "Name"                                                     = "fiap-tech-challenge-public-us-east-1b"
          + "Phase"                                                    = "3"
          + "Project"                                                  = "fiap-tech-challenge"
          + "Team"                                                     = "fiap-pos-grad"
          + "kubernetes.io/cluster/f
```

</details>

*Pushed by: @finhaa, Action: `pull_request`*